from db import get_db
from db.models import PostPhoto, UserPost, Comment, Hashtag

"""
UserPost functions
"""
# Cоздания поста
# Изменения поста
# Удаление поста
# Получение всех постов
# ПОлучение определенного поста

"""
Comment functions
"""
# Создание коммента
# Полчение коммента по его айди
# Получение всех комментов по айди поста
# Изменение коммента
# Удаление коммента

"""
Hashtag functions
"""
# Создание хэштега
# Получение хэштега по названию
# Получение всех хэштегов
# Удаление хэштега
# Изменение хэштега
